# Задача-2: Запросите от пользователя число, сохраните в переменную,
# прибавьте к числу 2 и выведите результат на экран.
# Если возникла ошибка, прочитайте ее, вспомните урок и постарайтесь устранить ошибку.

sleep = int(input('Введите количество часов необходимое вам для сна'))
print ('Вы ввели', sleep, 'часов, но на самом деле вам необходимо', sleep+2)
