# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран

name = input ('Введите ваше имя')
surname = input ('Введите вашу фамилию')
age = int(input('Сколько вам лет'))
print ('Добро пожаловать', name, surname, '!')
print ('Сегодня вам', age, ', неплохо')